simulacije_naloge/naloga_snappyHexMesh/0_orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
        inlet
    {
        type    calculated;
        value   uniform 0;
    }

    outlet
    {
        type    calculated;
        value   uniform 0;
    }

    ground
        {
        type            nutkWallFunction;
        value           uniform 0;
    }


    sym
    {
        type            symmetry;
    }
    
    "solid|frontTire|frontRim|rearTire|rearRim|frontWing|rearWingMain|rearWingSide|rearWingWinglet1|rearWingWinglet2|monococ|rearWingMain|difusor|sideDuct|sideWing"
    
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
        
    atmosphere
    {
        type    calculated;
        value   uniform 0;
    }
    
        "(bIn)"
    {
        type    calculated;
        value   uniform 0;
    }
    
    "(bOut1|bOut2|bOut3)"
    {
        type    calculated;
        value   uniform 0;
    }


}


// ************************************************************************* //
