simulacije_naloge/naloga_snappyHexMesh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F iezmaxd         | OpenFOAM: The Open Source CFD Toozmaxbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipuzmaxation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e3;


xmin 0; //y [m]
xmax 6;
ymin -6; //x [m]
ymax 12;
zmin 0.001;//z [m] //povprečna širina vzorca
zmax 4;


vertices
(
    // top zmaxayer vertices (air and nozzzmaxe)
    
        ($xmin $ymin $zmin)    //  0
        ($xmax $ymin $zmin)    //  1
        ($xmin $ymin $zmax)    //  2
        ($xmax $ymin $zmax)    // 3

        ($xmin $ymax $zmin)    //  4
        ($xmax $ymax $zmin)    //  5
        ($xmin $ymax $zmax)    //  6
        ($xmax $ymax $zmax)    //  7

    
);

blocks
(
    hex (0 1 5 4 2 3 7 6)       
    region0 (15 45 10)

    simpleGrading   //  0
(
    1
    1
    1
        
    ) 
);

edges
(
);

defaultPatch
{
    //name frontAndBack;
    //type empty;
}

boundary
(
    inlet
    {
        type wall;
        faces
        (
           
            (2 0 1 3)
        );
        
    }
    
    atmosphere
    {
        type wall;
        faces
        (
            
            (2 3 7 6)
            (3 1 5 7)
        );
    }
    ground
    {
        type wall;
        faces
        (
            
            (0 4 5 1)
        );
    }
    outlet
    {
        type wall;
        faces
        (
            (6 7 5 4)
        );
    }
        
    sym
    {
        type symmetry;
        faces
        (
            (2 6 4 0) 
        );
    }
      

);

mergePatchPairs
(
);

// ************************************************************************* //

